In [4]:
import pandas as pd
import numpy as np

In [5]:
df = pd.DataFrame(np.arange(12).reshape(3, 4),
                   columns=['A', 'B', 'C', 'D'])

In [6]:
df

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [7]:
df.drop(['B', 'C'], axis=1)

   A   D
0  0   3
1  4   7
2  8  11

In [8]:
df.drop(columns=['B', 'C'])

   A   D
0  0   3
1  4   7
2  8  11

In [9]:
df.drop([0, 1])

   A  B   C   D
2  8  9  10  11

In [10]:
data={
    "S.no":[0,1,2,3,4],
    "Name":["Eman","Ramna","Zainab","Maria","Laiba"],
    "Mobile":[343,453,234,123,334],
    "Gender":["F","F","F","F","F"],
    "Section":["A","C","A","C","A"]
}
#Load data into a Data Frame object:
df=pd.DataFrame(data)
print(df)

   S.no    Name  Mobile Gender Section
0     0    Eman     343      F       A
1     1   Ramna     453      F       C
2     2  Zainab     234      F       A
3     3   Maria     123      F       C
4     4   Laiba     334      F       A

In [11]:
df.drop([0, 1])

   S.no    Name  Mobile Gender Section
2     2  Zainab     234      F       A
3     3   Maria     123      F       C
4     4   Laiba     334      F       A